SkydiverMCU/mcu-iap-demo/Cortex-M0/MM32F0270/USB_Virtual_COM/MM32F0270_VCOM_Bootloader/Device/MM32F0270/Include/reg_common.h
////////////////////////////////////////////////////////////////////////////////
/// @file     reg_common.h
/// @author   AE TEAM
/// @brief    THIS FILE CONTAINS ALL THE FUNCTIONS PROTOTYPES FOR THE SERIES OF
///           MM32 FIRMWARE LIBRARY.
////////////////////////////////////////////////////////////////////////////////
/// @attention
///
/// THE EXISTING FIRMWARE IS ONLY FOR REFERENCE, WHICH IS DESIGNED TO PROVIDE
/// CUSTOMERS WITH CODING INFORMATION ABOUT THEIR PRODUCTS SO THEY CAN SAVE
/// TIME. THEREFORE, MINDMOTION SHALL NOT BE LIABLE FOR ANY DIRECT, INDIRECT OR
/// CONSEQUENTIAL DAMAGES ABOUT ANY CLAIMS ARISING OUT OF THE CONTENT OF SUCH
/// HARDWARE AND/OR THE USE OF THE CODING INFORMATION CONTAINED HEREIN IN
/// CONNECTION WITH PRODUCTS MADE BY CUSTOMERS.
///
/// <H2><CENTER>&COPY; COPYRIGHT MINDMOTION </CENTER></H2>
////////////////////////////////////////////////////////////////////////////////

// Define to prevent recursive inclusion

#ifndef __REG_COMMON_H
#define __REG_COMMON_H

// Files includes
#include <stdint.h>
#include <stdbool.h>
#include "types.h"


#if defined ( __CC_ARM )
#pragma anon_unions
#endif

#ifndef HSE_STARTUP_TIMEOUT
#define HSE_STARTUP_TIMEOUT             (0x08000U)                               ///< Time out for HSE start up.
#endif
#ifdef  CUSTOM_HSE_VAL
#ifndef HSE_VALUE
#define HSE_VALUE                       (12000000U)                             ///< Value of the External oscillator in Hz.
#endif
#else
#ifndef HSE_VALUE
#define HSE_VALUE                       (8000000U)                              ///< Value of the External oscillator in Hz.
#endif
#endif



#define HSI_VALUE_PLL_ON                (48000000U / 6)                         ///< Value of the Internal oscillator in Hz.
#define HSI_DIV6                        (48000000U / 6)                         ///< Value of the Internal oscillator in Hz.
// Value of the Internal oscillator in Hz.


#define LSI_VALUE                       (40000U)                                ///< Value of the Internal oscillator in Hz.



#ifndef HSI_VALUE
#define HSI_VALUE                       HSI_DIV6
#endif









#define __MPU_PRESENT                   (0)                                     ///< Cortex-M0 does not provide a MPU present or not
#ifndef __NVIC_PRIO_BITS
#define __NVIC_PRIO_BITS                (2)                                     ///< Cortex-M0 uses 2 Bits for the Priority Levels
//#warning "__NVIC_PRIO_BITS not defined in device header file; using default!"
#endif
#define __Vendor_SysTickConfig          (0)                                     ///< Set to 1 if different SysTick Config is used

////////////////////////////////////////////////////////////////////////////////
/// @brief  MM32 MCU Interrupt Handle
////////////////////////////////////////////////////////////////////////////////
typedef enum IRQn {

    NonMaskableInt_IRQn                 = -14,                                  ///< 2 Non Maskable Interrupt
    HardFault_IRQn                      = -13,                                  ///< 3 Cortex-M0 Hard Fault Interrupt
    SVC_IRQn                            = -5,                                   ///< 11 Cortex-M0 SV Call Interrupt
    DebugMonitor_IRQn                   = -4,                                   ///< 12 Cortex-M0 Debug Monitor Interrupt
    PendSV_IRQn                         = -2,                                   ///< 14 Cortex-M0 Pend SV Interrupt
    SysTick_IRQn                        = -1,                                   ///< 15 Cortex-M0 System Tick Interrupt

    WWDG_IWDG_IRQn                      = 0,                                    ///< WatchDog Interrupt
    WWDG_IRQn                           = 0,                                    ///< Window WatchDog Interrupt
    PVD_IRQn                            = 1,                                    ///< PVD through EXTI Line detect Interrupt
    RTC_BKP_IRQn                        = 2,                                    ///< RTC and BKP through EXTI Line Interrupt
    RTC_IRQn                            = 2,                                    ///< RTC through EXTI Line Interrupt
    FLASH_IRQn                          = 3,                                    ///< FLASH Interrupt
    RCC_CRS_IRQn                        = 4,                                    ///< RCC & CRS Interrupt
    RCC_IRQn                            = 4,                                    ///< RCC Interrupt
    EXTI0_1_IRQn                        = 5,                                    ///< EXTI Line 0 and 1 Interrupts
    EXTI2_3_IRQn                        = 6,                                    ///< EXTI Line 2 and 3 Interrupts
    EXTI4_15_IRQn                       = 7,                                    ///< EXTI Line 4 to 15 Interrupts
    HWDIV_IRQn                          = 8,                                    ///< HWDIV Global Interrupt
    DMA1_Channel1_IRQn                  = 9,                                    ///< DMA1 Channel 1 Interrupt
    DMA1_Channel2_3_IRQn                = 10,                                   ///< DMA1 Channel 2 and Channel 3 Interrupts
    DMA1_Channel4_5_IRQn                = 11,                                   ///< DMA1 Channel 4 and Channel 5 Interrupts
    DMA1_Channel4_5_6_7_IRQn            = 11,                                   ///< DMA1 Channel 4, Channel 5, Channel 6 and Channel 7 Interrupts
    ADC_COMP_IRQn                       = 12,                                   ///< ADC & COMP Interrupts
    COMP_IRQn                           = 12,                                   ///< COMP Interrupts
    ADC_IRQn                            = 12,                                   ///< ADC Interrupts
    ADC1_IRQn                           = 12,                                   ///< ADC Interrupts
    TIM1_BRK_UP_TRG_COM_IRQn            = 13,                                   ///< TIM1 Break, Update, Trigger and Commutation Interrupts
    TIM1_CC_IRQn                        = 14,                                   ///< TIM1 Capture Compare Interrupt
    TIM2_IRQn                           = 15,                                   ///< TIM2 Interrupt
    TIM3_IRQn                           = 16,                                   ///< TIM3 Interrupt
    LPUART1_IRQn                        = 17,                                   ///< LPUART1 Interrupt
    LPTIMER1_IRQn                       = 18,                                   ///< LPTIMER1 Interrupt
    TIM14_IRQn                          = 19,                                   ///< TIM14 Interrupt
    TIM15_IRQn                          = 20,                                   ///< TIM15 Interrupt
    TIM16_IRQn                          = 21,                                   ///< TIM16 Interrupt
    TIM17_IRQn                          = 22,                                   ///< TIM17 Interrupt
    I2C1_IRQn                           = 23,                                   ///< I2C1 Interrupt
    I2C2_IRQn                           = 24,                                   ///< I2C2 Interrupt
    SPI1_IRQn                           = 25,                                   ///< SPI1 Interrupt
    SPI2_IRQn                           = 26,                                   ///< SPI1 Interrupt
    UART1_IRQn                          = 27,                                   ///< UART1 Interrupt
    UART2_IRQn                          = 28,                                   ///< UART2 Interrupt
    UART3_4_IRQn                        = 29,                                   ///< UART3/4 Interrupt
    CAN_IRQn                            = 30,                                   ///< CAN Interrupt
    USB_IRQn                            = 31,                                   ///< USB Interrupt or EXTI18
} IRQn_Type;





